{"class_name": "Functional", "config": {"name": "Movi-LSTM-model_freeze", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "registered_name": null, "name": "inputs", "inbound_nodes": []}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "Stem", "config": {"name": "stem", "trainable": false, "dtype": "float32", "out_filters": 8, "kernel_size": [1, 3, 3], "strides": [1, 2, 2], "causal": false, "activation": "swish", "conv_type": "3d", "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_stem"}, "registered_name": "Vision>Stem", "build_config": {"input_shape": [null, null, null, null, 3]}, "name": "stem", "inbound_nodes": [[["inputs", 0, 0, {"states": {}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block0_layer0", "trainable": false, "dtype": "float32", "out_filters": 8, "expand_filters": 24, "kernel_size": [1, 5, 5], "strides": [1, 2, 2], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block0_layer0"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 8]}, "name": "block0_layer0", "inbound_nodes": [[["stem", 0, 0, {"states": {}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block1_layer0", "trainable": false, "dtype": "float32", "out_filters": 32, "expand_filters": 80, "kernel_size": [3, 3, 3], "strides": [1, 2, 2], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block1_layer0"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 8]}, "name": "block1_layer0", "inbound_nodes": [[["block0_layer0", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block0_layer0", 0, 1], "state_block0_layer0_pool_frame_count": ["block0_layer0", 0, 2]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block1_layer1", "trainable": false, "dtype": "float32", "out_filters": 32, "expand_filters": 80, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block1_layer1"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 32]}, "name": "block1_layer1", "inbound_nodes": [[["block1_layer0", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block1_layer0", 0, 1], "state_block0_layer0_pool_frame_count": ["block1_layer0", 0, 2], "state_block1_layer0_pool_buffer": ["block1_layer0", 0, 3], "state_block1_layer0_pool_frame_count": ["block1_layer0", 0, 4]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block1_layer2", "trainable": false, "dtype": "float32", "out_filters": 32, "expand_filters": 80, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block1_layer2"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 32]}, "name": "block1_layer2", "inbound_nodes": [[["block1_layer1", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block1_layer1", 0, 1], "state_block0_layer0_pool_frame_count": ["block1_layer1", 0, 2], "state_block1_layer0_pool_buffer": ["block1_layer1", 0, 3], "state_block1_layer0_pool_frame_count": ["block1_layer1", 0, 4], "state_block1_layer1_pool_buffer": ["block1_layer1", 0, 5], "state_block1_layer1_pool_frame_count": ["block1_layer1", 0, 6]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block2_layer0", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 184, "kernel_size": [5, 3, 3], "strides": [1, 2, 2], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block2_layer0"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 32]}, "name": "block2_layer0", "inbound_nodes": [[["block1_layer2", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block1_layer2", 0, 1], "state_block0_layer0_pool_frame_count": ["block1_layer2", 0, 2], "state_block1_layer0_pool_buffer": ["block1_layer2", 0, 3], "state_block1_layer0_pool_frame_count": ["block1_layer2", 0, 4], "state_block1_layer1_pool_buffer": ["block1_layer2", 0, 5], "state_block1_layer1_pool_frame_count": ["block1_layer2", 0, 6], "state_block1_layer2_pool_buffer": ["block1_layer2", 0, 7], "state_block1_layer2_pool_frame_count": ["block1_layer2", 0, 8]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block2_layer1", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 112, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block2_layer1"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "block2_layer1", "inbound_nodes": [[["block2_layer0", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block2_layer0", 0, 1], "state_block0_layer0_pool_frame_count": ["block2_layer0", 0, 2], "state_block1_layer0_pool_buffer": ["block2_layer0", 0, 3], "state_block1_layer0_pool_frame_count": ["block2_layer0", 0, 4], "state_block1_layer1_pool_buffer": ["block2_layer0", 0, 5], "state_block1_layer1_pool_frame_count": ["block2_layer0", 0, 6], "state_block1_layer2_pool_buffer": ["block2_layer0", 0, 7], "state_block1_layer2_pool_frame_count": ["block2_layer0", 0, 8], "state_block2_layer0_pool_buffer": ["block2_layer0", 0, 9], "state_block2_layer0_pool_frame_count": ["block2_layer0", 0, 10]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block2_layer2", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 184, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block2_layer2"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "block2_layer2", "inbound_nodes": [[["block2_layer1", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block2_layer1", 0, 1], "state_block0_layer0_pool_frame_count": ["block2_layer1", 0, 2], "state_block1_layer0_pool_buffer": ["block2_layer1", 0, 3], "state_block1_layer0_pool_frame_count": ["block2_layer1", 0, 4], "state_block1_layer1_pool_buffer": ["block2_layer1", 0, 5], "state_block1_layer1_pool_frame_count": ["block2_layer1", 0, 6], "state_block1_layer2_pool_buffer": ["block2_layer1", 0, 7], "state_block1_layer2_pool_frame_count": ["block2_layer1", 0, 8], "state_block2_layer0_pool_buffer": ["block2_layer1", 0, 9], "state_block2_layer0_pool_frame_count": ["block2_layer1", 0, 10], "state_block2_layer1_pool_buffer": ["block2_layer1", 0, 11], "state_block2_layer1_pool_frame_count": ["block2_layer1", 0, 12]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block3_layer0", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 184, "kernel_size": [5, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block3_layer0"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "block3_layer0", "inbound_nodes": [[["block2_layer2", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block2_layer2", 0, 1], "state_block0_layer0_pool_frame_count": ["block2_layer2", 0, 2], "state_block1_layer0_pool_buffer": ["block2_layer2", 0, 3], "state_block1_layer0_pool_frame_count": ["block2_layer2", 0, 4], "state_block1_layer1_pool_buffer": ["block2_layer2", 0, 5], "state_block1_layer1_pool_frame_count": ["block2_layer2", 0, 6], "state_block1_layer2_pool_buffer": ["block2_layer2", 0, 7], "state_block1_layer2_pool_frame_count": ["block2_layer2", 0, 8], "state_block2_layer0_pool_buffer": ["block2_layer2", 0, 9], "state_block2_layer0_pool_frame_count": ["block2_layer2", 0, 10], "state_block2_layer1_pool_buffer": ["block2_layer2", 0, 11], "state_block2_layer1_pool_frame_count": ["block2_layer2", 0, 12], "state_block2_layer2_pool_buffer": ["block2_layer2", 0, 13], "state_block2_layer2_pool_frame_count": ["block2_layer2", 0, 14]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block3_layer1", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 184, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block3_layer1"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "block3_layer1", "inbound_nodes": [[["block3_layer0", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block3_layer0", 0, 1], "state_block0_layer0_pool_frame_count": ["block3_layer0", 0, 2], "state_block1_layer0_pool_buffer": ["block3_layer0", 0, 3], "state_block1_layer0_pool_frame_count": ["block3_layer0", 0, 4], "state_block1_layer1_pool_buffer": ["block3_layer0", 0, 5], "state_block1_layer1_pool_frame_count": ["block3_layer0", 0, 6], "state_block1_layer2_pool_buffer": ["block3_layer0", 0, 7], "state_block1_layer2_pool_frame_count": ["block3_layer0", 0, 8], "state_block2_layer0_pool_buffer": ["block3_layer0", 0, 9], "state_block2_layer0_pool_frame_count": ["block3_layer0", 0, 10], "state_block2_layer1_pool_buffer": ["block3_layer0", 0, 11], "state_block2_layer1_pool_frame_count": ["block3_layer0", 0, 12], "state_block2_layer2_pool_buffer": ["block3_layer0", 0, 13], "state_block2_layer2_pool_frame_count": ["block3_layer0", 0, 14], "state_block3_layer0_pool_buffer": ["block3_layer0", 0, 15], "state_block3_layer0_pool_frame_count": ["block3_layer0", 0, 16]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block3_layer2", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 184, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block3_layer2"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "block3_layer2", "inbound_nodes": [[["block3_layer1", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block3_layer1", 0, 1], "state_block0_layer0_pool_frame_count": ["block3_layer1", 0, 2], "state_block1_layer0_pool_buffer": ["block3_layer1", 0, 3], "state_block1_layer0_pool_frame_count": ["block3_layer1", 0, 4], "state_block1_layer1_pool_buffer": ["block3_layer1", 0, 5], "state_block1_layer1_pool_frame_count": ["block3_layer1", 0, 6], "state_block1_layer2_pool_buffer": ["block3_layer1", 0, 7], "state_block1_layer2_pool_frame_count": ["block3_layer1", 0, 8], "state_block2_layer0_pool_buffer": ["block3_layer1", 0, 9], "state_block2_layer0_pool_frame_count": ["block3_layer1", 0, 10], "state_block2_layer1_pool_buffer": ["block3_layer1", 0, 11], "state_block2_layer1_pool_frame_count": ["block3_layer1", 0, 12], "state_block2_layer2_pool_buffer": ["block3_layer1", 0, 13], "state_block2_layer2_pool_frame_count": ["block3_layer1", 0, 14], "state_block3_layer0_pool_buffer": ["block3_layer1", 0, 15], "state_block3_layer0_pool_frame_count": ["block3_layer1", 0, 16], "state_block3_layer1_pool_buffer": ["block3_layer1", 0, 17], "state_block3_layer1_pool_frame_count": ["block3_layer1", 0, 18]}}]]]}, {"module": "official.projects.movinet.modeling.movinet_layers", "class_name": "MovinetBlock", "config": {"name": "block3_layer3", "trainable": false, "dtype": "float32", "out_filters": 56, "expand_filters": 184, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "causal": false, "activation": "swish", "gating_activation": "sigmoid", "se_ratio": 0.25, "stochastic_depth_drop_rate": 0.0, "conv_type": "3d", "se_type": "3d", "use_positional_encoding": false, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "batch_norm_momentum": 0.99, "batch_norm_epsilon": 0.001, "state_prefix": "state_block3_layer3"}, "registered_name": "Vision>MovinetBlock", "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "block3_layer3", "inbound_nodes": [[["block3_layer2", 0, 0, {"states": {"state_block0_layer0_pool_buffer": ["block3_layer2", 0, 1], "state_block0_layer0_pool_frame_count": ["block3_layer2", 0, 2], "state_block1_layer0_pool_buffer": ["block3_layer2", 0, 3], "state_block1_layer0_pool_frame_count": ["block3_layer2", 0, 4], "state_block1_layer1_pool_buffer": ["block3_layer2", 0, 5], "state_block1_layer1_pool_frame_count": ["block3_layer2", 0, 6], "state_block1_layer2_pool_buffer": ["block3_layer2", 0, 7], "state_block1_layer2_pool_frame_count": ["block3_layer2", 0, 8], "state_block2_layer0_pool_buffer": ["block3_layer2", 0, 9], "state_block2_layer0_pool_frame_count": ["block3_layer2", 0, 10], "state_block2_layer1_pool_buffer": ["block3_layer2", 0, 11], "state_block2_layer1_pool_frame_count": ["block3_layer2", 0, 12], "state_block2_layer2_pool_buffer": ["block3_layer2", 0, 13], "state_block2_layer2_pool_frame_count": ["block3_layer2", 0, 14], "state_block3_layer0_pool_buffer": ["block3_layer2", 0, 15], "state_block3_layer0_pool_frame_count": ["block3_layer2", 0, 16], "state_block3_layer1_pool_buffer": ["block3_layer2", 0, 17], "state_block3_layer1_pool_frame_count": ["block3_layer2", 0, 18], "state_block3_layer2_pool_buffer": ["block3_layer2", 0, 19], "state_block3_layer2_pool_frame_count": ["block3_layer2", 0, 20]}}]]]}, {"module": "keras.layers", "class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 56]}, "name": "conv_lstm2d", "inbound_nodes": [[["block3_layer3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 64]}, "name": "conv3d_transpose", "inbound_nodes": [[["conv_lstm2d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3, 3], "strides": [1, 3, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 32]}, "name": "conv3d_transpose_1", "inbound_nodes": [[["conv3d_transpose", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3, 3], "strides": [1, 5, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 16]}, "name": "conv3d_transpose_2", "inbound_nodes": [[["conv3d_transpose_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_3", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 16]}, "name": "conv3d_transpose_3", "inbound_nodes": [[["conv3d_transpose_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 8]}, "name": "conv_lstm2d_1", "inbound_nodes": [[["conv3d_transpose_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 64]}, "name": "conv_lstm2d_2", "inbound_nodes": [[["conv_lstm2d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 32]}, "name": "conv_lstm2d_3", "inbound_nodes": [[["conv_lstm2d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_4", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, null, null, null, 16]}, "name": "conv_lstm2d_4", "inbound_nodes": [[["conv_lstm2d_3", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["conv_lstm2d_4", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}